# LinePatternSegment Constructor (LinePatternSegmentType, Double)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinePatternSegment Constructor (LinePatternSegmentType, Double)
LinePatternSegment Class See Also
---
Creates a line pattern segment with given type and length.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public LinePatternSegment(
	LinePatternSegmentType type,
	double length
)
```

Visual Basic
---
```text
Public Sub New ( _
	type As LinePatternSegmentType, _
	length As Double _
)
```

Visual C++
---
```text
public:
LinePatternSegment(
	LinePatternSegmentType type,
	double length
)
```

# ### Parameters
type
    Type: Autodesk.Revit.DB..::..LinePatternSegmentType The segment type.
length
    Type: System..::..Double The length.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
LinePatternSegment Class
LinePatternSegment Overload
Autodesk.Revit.DB Namespace